#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/diogoleal/crispy-succotash/runs/run-7J7rzoRwbqvQTtCF

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0e69e7484e89d4539]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e42472939eefad29]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a6e4f24bbe0703d8]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f89ef7a992256aea]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05e0c406ea5410ed5]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-069947b3c99f15255]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0212f1e4f0ac681d7]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0eab2321587ed32a3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00153f9dbe402f3bd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-080134437917b0c38]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-018dadbf2b7d6fce6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06d0b78134a1357b7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-051a25c47ee2103b1]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0cbe4173cd5afe576]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06aba10313d0f5571]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0c90d20199e8527df]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00153f9dbe402f3bd1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0898da4179694a47c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cca0c749829cbc49]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09dd937c1d68c19d4]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0dfd4df39a0d6dd62]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e692c8fea0aeab52]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-04c155b780849e2bd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08681c37c57d512f6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-049f0941022d68b5e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01b8111fa5e5ef341]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06aba10313d0f55711080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0c90d20199e8527df1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0cbe4173cd5afe5761080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_network_interface.this will be created
  + resource "aws_network_interface" "this" {
      + id                 = (known after apply)
      + interface_type     = (known after apply)
      + ipv6_address_count = (known after apply)
      + ipv6_addresses     = (known after apply)
      + mac_address        = (known after apply)
      + outpost_arn        = (known after apply)
      + private_dns_name   = (known after apply)
      + private_ip         = (known after apply)
      + private_ips        = (known after apply)
      + private_ips_count  = (known after apply)
      + security_groups    = (known after apply)
      + source_dest_check  = true
      + subnet_id          = "subnet-080134437917b0c38"
      + tags_all           = (known after apply)

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # aws_placement_group.web will be created
  + resource "aws_placement_group" "web" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s"
      + placement_group_id = (known after apply)
      + strategy           = "cluster"
      + tags_all           = (known after apply)
    }

  # module.ec2_instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0aa77abf44f394dc6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = 2
      + cpu_threads_per_core                 = 1
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + hibernation                          = true
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "comics"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-080134437917b0c38"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKCmVjaG8gIkhlbGxvIFRlcnJhZm9ybSEiCg=="
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = "open"
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group k8s"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "sg-k8s-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "sg-k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "sg-k8s"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0f89ef7a992256aea"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.security_group.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets_cidr_blocks = [
      + "10.0.1.0/24",
      + "10.0.2.0/24",
      + "10.0.3.0/24",
    ]
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @diogoleal, Action: `pull_request`*